# Homebrew Brewfile for tcco/config
# Install: brew bundle --file=~/config/Brewfile

# =============================================================================
# TAPS
# =============================================================================

tap "anomalyco/tap"

# =============================================================================
# CORE SHELL TOOLS
# =============================================================================

brew "zsh"
brew "starship"              # Fast, minimal terminal prompt
brew "zoxide"               # Smarter cd command
brew "fzf"                  # Fuzzy finder
brew "atuin"                # Syncable shell history

# =============================================================================
# FILE UTILITIES
# =============================================================================

brew "eza"                  # Modern ls replacement
brew "bat"                  # Syntax-highlighted cat
brew "fd"                   # Fast find alternative
brew "ripgrep"              # Faster grep

# =============================================================================
# GIT TOOLS
# =============================================================================

brew "git"
brew "gh"
brew "delta"                # Syntax-highlighted git diffs

# =============================================================================
# DEVELOPMENT LANGUAGES & MANAGERS
# =============================================================================

brew "node"
brew "nvm"
brew "pnpm"
brew "yarn"
brew "python3"
brew "ruby"
brew "rust"                 # Includes rustfmt
brew "cmake"

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================

brew "neovim"               # Modern vim
brew "macvim"               # GUI vim
brew "the_silver_searcher"  # Code search (ag)
brew "tldr"                 # Simplified man pages
brew "httpie"               # Modern HTTP client
brew "direnv"               # Per-project environment
brew "stylua"               # Lua formatter
brew "prettierd"            # Prettier daemon
brew "docker-compose"

# =============================================================================
# AI TOOLS
# =============================================================================

brew "anomalyco/tap/opencode"

# =============================================================================
# GUI APPLICATIONS (Casks)
# =============================================================================

# Editors
# cask "cursor"               # AI-powered code editor
# cask "visual-studio-code"
cask "zed"

# Browsers
# cask "arc"
cask "google-chrome"
cask "firefox"

# Productivity
# cask "raycast"              # App launcher
cask "notion"
# cask "1password"
# cask "1password-cli"

# Dev Tools
cask "docker"
# cask "postman"
# cask "orbstack"             # Docker alternative
# cask "warp"                 # Terminal

# Communication
# cask "slack"
cask "discord"
# cask "whatsapp"
# cask "telegram"

# Utilities
cask "font-jetbrains-mono"

# Entertainment
# cask "spotify"

# =============================================================================
# OPTIONAL: Uncomment if needed
# =============================================================================

# Languages & Runtimes
# brew "go"
# brew "java"
# brew "php"
# brew "elixir"
# brew "deno"

# Additional Dev Tools
# cask "docker"
# cask "figma"
# cask "linear"
cask "ngrok"
# cask "warp"

# =============================================================================
# FORMATTING/LINTING
# =============================================================================

# Install via pip (after python setup)
# pip install black isort flake8 eslint_d
